Tekla.Structures.Plugins.DirectManipulation.Internal.Picker
The Tekla.Structures.Plugins.DirectManipulation.Internal.Picker class is used for picking points, faces, segments and objects in the model.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.pickCount
The pick count.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.#ctor(Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes,Tekla.BIM.DirectManipulation.Services.Toleration.TolerationDefinitionValue)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Internal.Picker class.
inputRange: The input range.
inputTypes: Type of the input.
pickDefinition: The pick definition.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.InputValidationRequested
Occurs when the user has tried to end the session before reaching the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange.Maximum.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.ObjectPicked
Occurs when the object is picked.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.PreviewRequested
Occurs when the preview should be drawn.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.CustomSnappedPointRequested
Occurs when custom snapping becomes available.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.PickEnded
Occurs when the tool is finished.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.PickSessionInterrupted
Occurs when the session gets interrupted by the DM platform.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.PickUndone
Occurs when picking is undone.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.PickDefinition
Gets the pick definition.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.PickType
Gets the type of the pick.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.InputRange
Gets the input amount.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.StartPickSession(System.String)
Starts the pick session.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.OnPickEnding(Tekla.BIM.DirectManipulation.Services.Picking.IPickerListener,Tekla.BIM.DirectManipulation.Services.Picking.PickerEndingEventArgs)
Raises the Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.InputValidationRequested event.
sender: The picker.
eventArgs: The pick ending event arguments.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.OnPickEnded(Tekla.BIM.DirectManipulation.Services.Picking.IPickerListener,Tekla.BIM.DirectManipulation.Services.Picking.PickerEndedEventArgs)
Event to be taken when picking has been completed.
sender: The picker.
eventArgs: The pick ended event arguments.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.OnPickPointTolerated(Tekla.BIM.DirectManipulation.Services.Picking.IPickerListener,Tekla.BIM.DirectManipulation.Services.Picking.PickPointResolveEventArgs)
Event to be taken during pick toleration.
sender: The picker.
eventArgs: The tolerated pick point event arguments.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.OnPickUndone(Tekla.BIM.DirectManipulation.Services.Picking.IPickerListener,Tekla.BIM.DirectManipulation.Services.Picking.PickEventArgs)
Event to be taken when the picking of the last input needs to be undone.
sender: The picker.
eventArgs: The pick input event args.

Tekla.Structures.Plugins.DirectManipulation.Internal.Picker.OnPicked(Tekla.BIM.DirectManipulation.Services.Picking.IPickerListener,Tekla.BIM.DirectManipulation.Services.Picking.PickDeltaEventArgs)
Event to be taken when an input is picked.
sender: The picker.
eventArgs: The pick point event arguments.